Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/include/pic32cx5112mtc128s1.h
/*
 * Header file for PIC32CX5112MTC128S1
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* File generated from device description version 2022-04-29T12:44:20Z */
#ifndef _PIC32CX5112MTC128S1_H_
#define _PIC32CX5112MTC128S1_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "2.1.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (1)
#define HEADER_FORMAT_VERSION_PATCH (0)

/* PIC32CX5112MTC128S1 definitions
  This file defines all structures and symbols for PIC32CX5112MTC128S1:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) x    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) x   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) x   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/* CMSIS DEFINITIONS FOR PIC32CX5112MTC128S1                                */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M4 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  MemoryManagement_IRQn     = -12, /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn             = -11, /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /* -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/******  PIC32CX5112MTC128S1 specific Interrupt Numbers ***********************************/
  SUPC_IRQn                 =   0, /* 0   Supply Controller (SUPC)            */
  RSTC_IRQn                 =   1, /* 1   Reset Controller (RSTC)             */
  RTC_IRQn                  =   2, /* 2   Real-time Clock (RTC)               */
  RTT_IRQn                  =   3, /* 3   Real-time Timer (RTT)               */
  DWDT0_IRQn                =   4, /* 4   Dual Watchdog Timer (DWDT)          */
  DWDT1_IRQn                =   5, /* 5   Dual Watchdog Timer (DWDT)          */
  PMC_IRQn                  =   6, /* 6   Power Management Controller (PMC)   */
  FLEXCOM0_IRQn             =   9, /* 9   Flexible Serial Communication (FLEXCOM0) */
  FLEXCOM1_IRQn             =  10, /* 10  Flexible Serial Communication (FLEXCOM1) */
  FLEXCOM2_IRQn             =  11, /* 11  Flexible Serial Communication (FLEXCOM2) */
  FLEXCOM3_IRQn             =  12, /* 12  Flexible Serial Communication (FLEXCOM3) */
  FLEXCOM4_IRQn             =  13, /* 13  Flexible Serial Communication (FLEXCOM4) */
  FLEXCOM5_IRQn             =  14, /* 14  Flexible Serial Communication (FLEXCOM5) */
  FLEXCOM6_IRQn             =  15, /* 15  Flexible Serial Communication (FLEXCOM6) */
  FLEXCOM7_IRQn             =  16, /* 16  Flexible Serial Communication (FLEXCOM7) */
  PIOA_IRQn                 =  17, /* 17  Parallel Input/Output Controller (PIOA) */
  PIOA_SEC_IRQn             =  18, /* 18  Parallel Input/Output Controller (PIOA) */
  PIOB_IRQn                 =  19, /* 19  Parallel Input/Output Controller (PIOB) */
  PIOB_SEC_IRQn             =  20, /* 20  Parallel Input/Output Controller (PIOB) */
  PIOC_IRQn                 =  21, /* 21  Parallel Input/Output Controller (PIOC) */
  PIOC_SEC_IRQn             =  22, /* 22  Parallel Input/Output Controller (PIOC) */
  QSPI_IRQn                 =  23, /* 23  Quad Serial Peripheral Interface (QSPI) */
  ADC_IRQn                  =  24, /* 24  Analog-to-Digital Converter (ADC)   */
  ACC_IRQn                  =  25, /* 25  Analog Comparator Controller (ACC)  */
  IPC0_IRQn                 =  28, /* 28  Inter-processor Communication (IPC0) */
  SLCDC_IRQn                =  29, /* 29  Segment LCD Controller (SLCDC)      */
  MEM2MEM0_IRQn             =  30, /* 30  Memory to Memory (MEM2MEM0)         */
  TC0_CH0_IRQn              =  31, /* 31  Timer Counter (TC0)                 */
  TC0_CH1_IRQn              =  32, /* 32  Timer Counter (TC0)                 */
  TC0_CH2_IRQn              =  33, /* 33  Timer Counter (TC0)                 */
  TC1_CH0_IRQn              =  34, /* 34  Timer Counter (TC1)                 */
  TC1_CH1_IRQn              =  35, /* 35  Timer Counter (TC1)                 */
  TC1_CH2_IRQn              =  36, /* 36  Timer Counter (TC1)                 */
  TC2_CH0_IRQn              =  37, /* 37  Timer Counter (TC2)                 */
  TC2_CH1_IRQn              =  38, /* 38  Timer Counter (TC2)                 */
  TC2_CH2_IRQn              =  39, /* 39  Timer Counter (TC2)                 */
  TC0_C0SEC_IRQn            =  40, /* 40  Timer Counter (TC0)                 */
  TC0_C1SEC_IRQn            =  41, /* 41  Timer Counter (TC0)                 */
  TC0_C2SEC_IRQn            =  42, /* 42  Timer Counter (TC0)                 */
  TC1_C0SEC_IRQn            =  43, /* 43  Timer Counter (TC1)                 */
  TC1_C1SEC_IRQn            =  44, /* 44  Timer Counter (TC1)                 */
  TC1_C2SEC_IRQn            =  45, /* 45  Timer Counter (TC1)                 */
  TC2_C0SEC_IRQn            =  46, /* 46  Timer Counter (TC2)                 */
  TC2_C1SEC_IRQn            =  47, /* 47  Timer Counter (TC2)                 */
  TC2_C2SEC_IRQn            =  48, /* 48  Timer Counter (TC2)                 */
  MATRIX1_IRQn              =  61, /* 61  AHB Bus Matrix (MATRIX1)            */
  SUPC_WKUP3_IRQn           =  62, /* 62  Supply Controller (SUPC)            */
  SUPC_WKUP4_IRQn           =  63, /* 63  Supply Controller (SUPC)            */
  SUPC_WKUP5_IRQn           =  64, /* 64  Supply Controller (SUPC)            */
  SUPC_WKUP6_IRQn           =  65, /* 65  Supply Controller (SUPC)            */
  SUPC_WKUP7_IRQn           =  66, /* 66  Supply Controller (SUPC)            */
  SUPC_WKUP8_IRQn           =  67, /* 67  Supply Controller (SUPC)            */
  SUPC_WKUP9_IRQn           =  68, /* 68  Supply Controller (SUPC)            */
  SUPC_WKUP10_IRQn          =  69, /* 69  Supply Controller (SUPC)            */
  SUPC_WKUP11_IRQn          =  70, /* 70  Supply Controller (SUPC)            */
  SUPC_WKUP12_IRQn          =  71, /* 71  Supply Controller (SUPC)            */
  SUPC_WKUP13_IRQn          =  72, /* 72  Supply Controller (SUPC)            */
  SUPC_WKUP14_IRQn          =  73, /* 73  Supply Controller (SUPC)            */
  SUPC_WKUP15_IRQn          =  74, /* 74  Supply Controller (SUPC)            */
  MEM2MEM1_IRQn             =  78, /* 78  Memory to Memory (MEM2MEM1)         */
  TC3_CHANNEL0_IRQn         =  79, /* 79  Timer Counter (TC3)                 */
  TC3_CHANNEL1_IRQn         =  80, /* 80  Timer Counter (TC3)                 */
  TC3_CHANNEL2_IRQn         =  81, /* 81  Timer Counter (TC3)                 */
  TC3_C0SEC_IRQn            =  82, /* 82  Timer Counter (TC3)                 */
  TC3_C1SEC_IRQn            =  83, /* 83  Timer Counter (TC3)                 */
  TC3_C2SEC_IRQn            =  84, /* 84  Timer Counter (TC3)                 */
  PIOD_IRQn                 =  85, /* 85  Parallel Input/Output Controller (PIOD) */
  PIOD_SEC_IRQn             =  86, /* 86  Parallel Input/Output Controller (PIOD) */
  UART_IRQn                 =  87, /* 87  Universal Asynchronous Receiver Transmitter (UART) */
  IPC1_IRQn                 =  88, /* 88  Inter-processor Communication (IPC1) */
  MCSPI_IRQn                =  89, /* 89  Multi Channel Serial Peripheral Interface (MCSPI) */
  PWM_IRQn                  =  90, /* 90  Pulse Width Modulation Controller (PWM) */
  MATRIX2_IRQn              =  94, /* 94  AHB Bus Matrix (MATRIX2)            */
  MATRIX3_IRQn              =  95, /* 95  AHB Bus Matrix (MATRIX3)            */

  PERIPH_MAX_IRQn           =  95  /* Max peripheral ID */
} IRQn_Type;
